[{"route":"/"},{"route":"/episode/1-13-2020-partial-application-currying","title":"Partial Application (not Currying)","description":"Today we'll discuss partial application and currying. By the end of the episode, you'll understand what these two different concepts are how they are different from each other, and where you can apply them in practice. In between the episode, we'll also talk about the brilliant computer scientist Haskell Curry, and we'll mention the Curry-Howard isomorphism.","audio":"https://feeds.soundcloud.com/stream/743152012-the-programming-podcast-episode-3-partial-application-not-currying.mp3","publish":true},{"route":"/episode/1-20-2020-quickselect-algorithm","title":"Quickselect","description":"Today we're going to talk about quickselect. This algorithm helps us quickly find the n-th smallest element in unsorted arrays. It'll not only help you improve the performance of your applications, but it's also a very common white-board interview problem.","audio":"https://feeds.soundcloud.com/stream/746885413-the-programming-podcast-episode-4-quickselect.mp3","publish":true},{"route":"/episode/1-27-2020-arrays-linked-lists","title":"Arrays and Linked Lists","description":"In this episode, we'll discuss two fundamental data structures in computer science - arrays and linked lists. Their understanding is essential not only in your day to day job but also for performing well on your next coding interview.","audio":"https://feeds.soundcloud.com/stream/750751408-the-programming-podcast-episode-5-arrays-and-linked-lists.mp3","publish":true},{"route":"/episode/1-4-2020-how-compilers-work","title":"How Compilers Work","description":"In this episode, we discuss how compilers work. By the end of the show, you'll have a high-level understanding of the phases the source code you write goes though before executed!","audio":"https://feeds.soundcloud.com/stream/738933013-the-programming-podcast-episode-1-how-compilers-work.mp3","publish":true},{"route":"/episode/1-5-2020-binary-search","title":"Binary Search","description":"Today we'll discuss the binary search algorithm. We'll go through several examples when the algorithm makes sense and discuss in detail how it works. By the end of the episode, you'll know when to apply a binary search and know why it's more efficient than a linear search.","audio":"https://feeds.soundcloud.com/stream/738933715-the-programming-podcast-episode-2-binary-search.mp3","publish":true},{"route":"/episode/2-03-2020-graphs-and-graph-traversal","title":"Graphs and Graph Traversal","description":"In this episode, we'll discuss graphs. You'll learn how this data structure looks like and what are its applications. Later on, we'll talk about algorithms for traversing graphs. You'll understand how breadth-first search and depth-first search work and when you should use one instead of the other. Topics we'll also touch on are chromatic graphs and finding the shortest path.","audio":"https://feeds.soundcloud.com/stream/754730377-the-programming-podcast-episode-6-graphs-and-graph-traversal.mp3","publish":true},{"route":"/episode/2-10-2020-tries","title":"Tries","description":"In the episode today, we'll talk about the trie data structure. You'll learn what tries are, how you can use them in practice, and how to implement them in your favorite programming language!","audio":"https://feeds.soundcloud.com/stream/758632885-the-programming-podcast-episode-7-tries.mp3","publish":true},{"route":"/episode/2-17-2020-decorator-pattern","title":"Decorator Pattern","description":"Today you'll learn how at runtime, you can enhance the behavior or existing objects using the decorator pattern. In this episode, we'll discuss the advantages of decorators over inheritance and look at two examples from real-life - implementing a network communication protocol and enriching user interface components.","audio":"https://feeds.soundcloud.com/stream/762511612-the-programming-podcast-decorator-pattern.mp3","publish":true},{"route":"/episode/2-25-2020-sorting-counting-sort","title":"Sorting. Counting Sort.","description":"Have you ever been frustrated during interviews thinking that your interviewer expects you to have memorized a bunch of sorting algorithms you'd never need in real life? In this episode of the podcast learn how to approach such situations. In performance critical systems you may have to implement an efficient sorting yourself. Learn how to beat the built-in algorithm in a few lines of code!","audio":"http://feeds.soundcloud.com/stream/766603615-the-programming-podcast-sorting-counting-sort.mp3","publish":true},{"route":"/episode/3-2-2020-topological-sort","title":"Topological Sort","description":"In this episode, you'll learn the topological sort algorithm. Along the way, you'll understand what's a dependency graph and how topological sort operates on this data structure. We'll also discuss a few real-life examples where I had to implement topological sort myself!","audio":"https://feeds.soundcloud.com/stream/769948273-the-programming-podcast-episode-10-topological-sort.mp3","publish":true},{"route":"/about"}]